jliphard/wearable_nRF52_Firmware/main.c
	memcpy(lsample_buffer_rx, p_buffer, (4*number_of_words));                                              // Copy I2S data from the callback buffer to a volitile buffer
	
	// Parse I2S callback data and load into a byte array
	for(uint32_t i=0; i<number_of_words; i++)
	{
	  u.word = lsample_buffer_rx[i];
	  for(uint8_t j=0; j<4; j++)
	  {
	    lsample_byte_buffer_rx[((4*i) + j)] = u.byte_decomp[3-j];
	  }
	}
	
	// Load I2S byte array into the ring buffer and index write pointer
	count = (4*number_of_words);
	size = count;
	if((i2s_write + count) > RINGBUFFER_SIZE)                                                              // IF I2S byte count is larger than the space before pointer wrap, break into two pieces
    {
      count = RINGBUFFER_SIZE - i2s_write;
    }
    if(count)
	{
	  for(uint32_t i=0; i<count; i++)
	  {
	    ringbuffer[i2s_write + i] = lsample_byte_buffer_rx[i];
	  }
	  i2s_write += count;
      size -= count;
	  offset = count;
      if(i2s_write == RINGBUFFER_SIZE)                                                                     // Wrap the write pointer
      {
        i2s_write = 0;
      }
    }
    count = size;
    if(count)                                                                                              // If broken into two parts, do the second part
	{
	  for(uint32_t i=0; i<count; i++)
	  {
	     ringbuffer[i2s_write + i] = lsample_byte_buffer_rx[offset + i];
	  }
	  i2s_write += count;
      if(i2s_write == RINGBUFFER_SIZE)
      {
        i2s_write = 0;
      }
    }
	  
    return true;
}

static void check_rx_data(uint32_t const * p_buffer, uint16_t number_of_words)
{
    if (!m_error_encountered)
    {
        m_error_encountered = !copy_samples(p_buffer, number_of_words);
    }
}

// This is the I2S data handler - all data exchange related to the I2S transfers is done here.
static void data_handler(uint32_t const * p_data_received,
                         uint32_t       * p_data_to_send,
                         uint16_t         number_of_words)
{
    // Non-NULL value in 'p_data_received' indicates that a new portion of
    // data has been received and should be processed.
    if (p_data_received != NULL)
    {
        check_rx_data(p_data_received, number_of_words);
    }

    // Non-NULL value in 'p_data_to_send' indicates that the driver needs
    // a new portion of data to send. Nothing done here; RX only...
    if (p_data_to_send != NULL)
    {
    }
}


void app_error_fault_handler(uint32_t id, uint32_t pc, uint32_t info)
{
    #ifdef DEBUG
    app_error_print(id, pc, info);
    #endif

    while (1);
}

APP_PWM_INSTANCE(PWM1,0);                                                                                  // Create the instance "PWM1" using TIMER0.
APP_PWM_INSTANCE(PWM2,1);                                                                                  // Create the instance "PWM2" using TIMER1.

#define BLE_UUID_MENTAID_SERVICE           0x180D 
//#define BLE_UUID_MENTAID_MEASUREMENT_CHAR  0x2A37
//#define BLE_UUID_BODY_SENSOR_LOCATION_CHAR 0x2A38
//UUID string

#define DEVICE_NAME                      "MENTAID"                                 /**< Name of device. Will be included in the advertising data. */
#define MANUFACTURER_NAME                "Stanford University"                     /**< Manufacturer. Will be passed to Device Information Service. */
#define APP_ADV_INTERVAL                 1600                                      // The advertising interval (in units of 0.625 ms) 1600*0.625 = 1000 ms
                                                                                   // 3200 = 2 seconds
#define APP_ADV_TIMEOUT_IN_SECONDS       100                                       // The advertizing timeout in units of seconds. Used to be 180 seconds
                                                                                   // 0 = infinite advertizing                                                                                        
#define CONN_CFG_TAG                     1                                         //< A tag that refers to the BLE stack configuration we set with @ref sd_ble_cfg_set. Default tag is @ref BLE_CONN_CFG_TAG_DEFAULT. */

#define MEAS_INTERVAL                    APP_TIMER_TICKS(1000)
#define SENSOR_CONTACT_DETECTED_INTERVAL APP_TIMER_TICKS(5000)                      /**< Sensor Contact Detected toggle interval (ticks). */

#define MIN_CONN_INTERVAL                MSEC_TO_UNITS( 30, UNIT_1_25_MS)           /**< Minimum acceptable connection interval (0.03 seconds). */
#define MAX_CONN_INTERVAL                MSEC_TO_UNITS(200, UNIT_1_25_MS)           /**< Maximum acceptable connection interval (0.65 second). */
#define SLAVE_LATENCY                    0                                          /**< Slave latency. */
#define CONN_SUP_TIMEOUT                 MSEC_TO_UNITS(4000, UNIT_10_MS)            /**< Connection supervisory timeout (4 seconds). */

#define FIRST_CONN_PARAMS_UPDATE_DELAY   APP_TIMER_TICKS(5000)                      /**< Time from initiating event (connect or start of notification) to first time sd_ble_gap_conn_param_update is called (5 seconds). */
#define NEXT_CONN_PARAMS_UPDATE_DELAY    APP_TIMER_TICKS(30000)                     /**< Time between each call to sd_ble_gap_conn_param_update after the first call (30 seconds). */
#define MAX_CONN_PARAMS_UPDATE_COUNT     3                                          /**< Number of attempts before giving up the connection parameter negotiation. */

#define SEC_PARAM_BOND                   1                                          /**< Perform bonding. */
#define SEC_PARAM_MITM                   0                                          /**< Man In The Middle protection not required. */
#define SEC_PARAM_LESC                   0                                          /**< LE Secure Connections not enabled. */
#define SEC_PARAM_KEYPRESS               0                                          /**< Keypress notifications not enabled. */
#define SEC_PARAM_IO_CAPABILITIES        BLE_GAP_IO_CAPS_NONE                       /**< No I/O capabilities. */
#define SEC_PARAM_OOB                    0                                          /**< Out Of Band data not available. */
#define SEC_PARAM_MIN_KEY_SIZE           7                                          /**< Minimum encryption key size. */
#define SEC_PARAM_MAX_KEY_SIZE           16                                         /**< Maximum encryption key size. */

#define DEAD_BEEF                        0xDEADBEEF                                 /**< Value used as error code on stack dump, can be used to identify stack location on stack unwind. */

#define APP_FEATURE_NOT_SUPPORTED        BLE_GATT_STATUS_ATTERR_APP_BEGIN + 2       /**< Reply when unsupported features are requested. */

static uint16_t  m_conn_handle = BLE_CONN_HANDLE_INVALID; /**< Handle of the current connection. */

static ble_bas_t m_bas;                                   /**< Structure used to identify the battery service. */
static ble_ma_t m_ma;                                     /**< Structure used to identify the mentaid service. */
static nrf_ble_gatt_t m_gatt;                             /**< Structure for gatt module*/

//this uses the RTC1
APP_TIMER_DEF(m_timer_id);

static ble_uuid_t m_adv_uuids[] = 
{
    {BLE_UUID_MENTAID_SERVICE,            BLE_UUID_TYPE_BLE},
    {BLE_UUID_BATTERY_SERVICE,            BLE_UUID_TYPE_BLE},
    {BLE_UUID_DEVICE_INFORMATION_SERVICE, BLE_UUID_TYPE_BLE}
}; /* Universally unique service identifiers. */

static uint16_t heartbeat16 = 0;

static int32_t  resultPTH[3]; //PTH from sensor 1
static int16_t  resultVME[4];
static int16_t  resultBMA[3];
static float    resultFDC[4];

static uint8_t  battery_level8        = 0;
static uint8_t  battery_level_Percent = 0;
static uint8_t  fb[16];

