jliphard/wearable_nRF52_Firmware/main.c
    /*
    float ax = (float)resultBMA[0];
    float ay = (float)resultBMA[1];
    float az = (float)resultBMA[2];//take off gravity
    
    float accelT = (ax*ax) + (ay*ay) + (az*az);
    
    accelT = sqrt(accelT);
    */
    
    //SEGGER_RTT_printf(0, "x-axis offset = %d mg\n", (int16_t)(100.0f*(float)offsetX*FCres/256.0f));
    //SEGGER_RTT_printf(0, "accel:%d\n", (uint16_t)accelT);
        
    uint8_t action = 0;
    
    if( SaveToFLASH && LiveStream )
    {
        action = 2;
        save_or_stream( action, heartbeat16, battery_level8,
                      BMP280P8, BMP280T8, BMP280H8,
                      resultVME[3],
                      resultBMA[0], resultBMA[1], resultBMA[2] );    
    }
    else if ( SaveToFLASH && !LiveStream ) //save only
    {
        action = 0;
        save_or_stream( action, heartbeat16, battery_level8,
                      BMP280P8, BMP280T8, BMP280H8,
                      resultVME[3],
                      resultBMA[0], resultBMA[1], resultBMA[2] );    
    }
    else if ( !SaveToFLASH && LiveStream ) //stream only
    {
        action = 1;
        save_or_stream( action, heartbeat16, battery_level8,
                      BMP280P8, BMP280T8, BMP280H8,
                      resultVME[3],
                      resultBMA[0], resultBMA[1], resultBMA[2] );    
    }
   
}

static void timeout_handler(void * p_context)
{
    UNUSED_PARAMETER(p_context);
    //SEGGER_RTT_WriteString(0, "TH.\n"); 
    update_fast();
}

int main(void)
{
    SEGGER_RTT_WriteString(0, "\n\n***********\n");
    
    RTC1_timer_init();
     
    leds_init();
    
    bool erase_bonds = true;
    
    //buttons_leds_init(&erase_bonds);
    
    if( 1 == 2 ) {
        lfclk_request(); // Request LF clock - needed when softdevice is off
    } else {
        ble_stack_init(); //fire up the softdevice
    }
        
    gap_params_init();
    
    gatt_init();
    
    advertising_init();
    
    ble_services_init();   
    
    conn_params_init();
    
    peer_manager_init();
    
    //ADC subsystem 
    ADC_init();
        
    //I2C bus 
    I2C_init();
    
    //BME280 init
    BME280_Turn_On();
    nrf_delay_ms(500);
    
    //VEML6040 function is broken on board rev 2 - will be fixed for rev 3
    //VEML6040_Turn_On();
    nrf_delay_ms(500);
    
    FDC1004_Turn_On();
    nrf_delay_ms(500);
    
    //AD5593R init
    AD5593R_Turn_On();
    nrf_delay_ms(500);
    
    BMA280_Turn_On_Fast();
    nrf_delay_ms(500);
    
    BMA280_Calibrate();  
    nrf_delay_ms(500);
    
    //save energy - do not need to sample that quickly
    BMA280_Turn_On_Slow();
    
    //Flash memory
    FLASH_Init();
    
    FLASH_Print_ID();
    
    nrf_delay_ms(500);
    
    //FLASH_Reset();    
    //FLASH_Erase();
    
    GLOB_datastart = FLASH_Get_First_Available_Location();
    SEGGER_RTT_printf(0, "First empty page: %d\r\n", GLOB_datastart);
    
    flash_red();
    
    //static uint8_t lR[16];
     
    /* The four basic functions are to:
     * (1) erase
     * (2) record
     * (3) record + stream data to phone. 
     * (4) get data from phone - especially position and time
     * 
     * We could advertize for two mins after turn on. 
     * If no connection -> record
     * If connection, then would synchronize time, and get occasional GPS packets.
     * Also, would send data to phone app. 
     * In the same app, could chose to delete data
     * Could also flush data to pubnub?
    */ 
    
    RTC1_timer_start();
    
    //controls visibility to bluetooth - not clear to me if advertizing interval is honored
    advertising_start(erase_bonds);
     
    //send initial status packet
    update_status_flags();
    
    //Digital mic
    //Define the I2S configuration; running in slave mode and using PWM outputs to provide synthetic SCK and LRCK
    nrf_drv_i2s_config_t config = NRF_DRV_I2S_DEFAULT_CONFIG;
    config.sdin_pin             = I2S_SDIN_PIN;
    config.sdout_pin            = I2S_SDOUT_PIN;
    config.mode                 = NRF_I2S_MODE_SLAVE;
    config.mck_setup            = NRF_I2S_MCK_DISABLED;
    config.sample_width         = NRF_I2S_SWIDTH_24BIT;
    config.channels             = NRF_I2S_CHANNELS_LEFT;                                                    // Set the I2S microphone to output on the left channel
    config.format               = NRF_I2S_FORMAT_I2S;
    err_code                    = nrf_drv_i2s_init(&config, data_handler);                                  // Initialize the I2S driver
    
    APP_ERROR_CHECK(err_code);
	
    // 1-channel PWM; 16MHz clock and period set in ticks.
    // The user is responsible for selecting the periods to give the correct ratio for the I2S frame length
    
    app_pwm_config_t pwm1_cfg = APP_PWM_DEFAULT_CONFIG_1CH(  25L, PWM_I2S_SCK_PIN);                         // SCK; pick a convenient gpio pin
    app_pwm_config_t pwm2_cfg = APP_PWM_DEFAULT_CONFIG_1CH(1600L, PWM_I2S_WS_PIN );                         // LRCK; pick a convenient gpio pin. LRCK period = 64X SCK period

    // Initialize and enable PWM's
    
    //err_code = app_pwm_ticks_init(&PWM1,&pwm1_cfg,pwm_ready_callback);
    //APP_ERROR_CHECK(err_code);
    
    err_code = app_pwm_ticks_init(&PWM2,&pwm2_cfg,pwm_ready_callback);
    APP_ERROR_CHECK(err_code);
    
    //app_pwm_enable(&PWM1);
    app_pwm_enable(&PWM2);
    //app_pwm_channel_duty_set(&PWM1, 0, 50);                                                                // Set at 50% duty cycle for square wave
    app_pwm_channel_duty_set(&PWM2, 0, 50);
    
    // Instantiate I2S
    err_code = nrf_drv_i2s_start(m_buffer_rx, NULL, I2S_BUFFER_SIZE, 0);                                   // RX only; "NULL" XMIT buffer
       
    APP_ERROR_CHECK(err_code);
    
    memset(m_buffer_rx, 0xCC, sizeof(m_buffer_rx));                                                        // Initialize I2S data callback buffer
    
    
    while( 1 ) 
    {
        //upload all stored data to phone, for plotting/cloud upload
        if ( PleaseFlush ) {
            
                bool OldStateSampleSensors = SampleSensors;
                bool OldStateSaveToFLASH   = SaveToFLASH;
                bool OldStateLiveStream    = LiveStream;
                
                SampleSensors = false;
                SaveToFLASH   = false;
                LiveStream    = false;
                
                //RTC1_timer_stop();
                
                uint16_t lastLineWithData = GLOB_datastart * 16; /*16 lines per page; GLOB_datastart is in page units*/
                
                static uint8_t lR[16];
                
                for( uint16_t i = 0; i < lastLineWithData; i++) 
                {  
                    nrf_delay_ms(100);
                    
                    FLASH_Line_Read(i, lR);
                    
