jliphard/wearable_nRF52_Firmware/main.c
                    //pack in the page data
                    lR[14] = (uint8_t) ( i       & 0xff);
                    lR[15] = (uint8_t) ( i >> 8  & 0xff); 
                    
                    //cannot send faster than the connection internal, which is 50 ms
                    ma_measurement_send_16( &m_ma, lR );
                };
    
                //and go back to previous state....
                SampleSensors = OldStateSampleSensors;
                SaveToFLASH   = OldStateSaveToFLASH;
                LiveStream    = OldStateLiveStream;
                
                PleaseFlush = false;
        }
        
        //Erase the NOR FLASH completely
        if ( PleaseWipe ) {
            
                bool OldStateSampleSensors = SampleSensors;
                bool OldStateSaveToFLASH   = SaveToFLASH;
                bool OldStateLiveStream    = LiveStream;
                
                SampleSensors = false;
                SaveToFLASH   = false;
                LiveStream    = false;
                
                FLASH_Erase();
                //wait for this to complete
                //not sure how long
                GLOB_datastart = FLASH_Get_First_Available_Location();
                SEGGER_RTT_printf(0, "First empty page: %d\r\n", GLOB_datastart);
    
                if( GLOB_datastart != 0) {
                    SEGGER_RTT_printf(0, "Ooops, this really should be zero after wipe: %d\r\n", GLOB_datastart);
                }
                
                //and go back to previous state....
                SampleSensors = OldStateSampleSensors;
                SaveToFLASH   = OldStateSaveToFLASH;
                LiveStream    = OldStateLiveStream;
                
                PleaseWipe = false;
        }
        
        __WFE();
    };
     
    /*
    for (;;)
        {
            if (NRF_LOG_PROCESS() == false)
            {
                power_manage();
            }
        }
    */
}
